docs/Instruction_flow.tex
% Created 2018-02-11 Sun 16:01
\documentclass[12pt,letterpaper]{article}
\usepackage{graphicx,rotating,overpic,eepic,amssymb,amsmath,color,wasysym,hyperref,soul}
%\usepackage[backend=biber,natbib=true,style=numeric,sorting=none,firstinits=true,maxbibnames=15]{biblatex}
\usepackage[numbers]{natbib} 
%\bibliography{libraryFixed}
\usepackage{longtable}
\usepackage{xspace}
\usepackage{float}% hello ;)
\newcommand{\commentt}[1]{}
\newcommand{\Rey}{\mbox{\textit{Re}}}  % Reynolds number
\newcommand{\ReyRBC}{\Rey_\mathrm{RBC}}  % Reynolds number
\newcommand{\mum}{$\mu$m\xspace}
\newcommand{\muL}{$\mu$L\xspace}
\newcommand{\capi}{\mathrm{Ca}}
\newcommand{\gdot}{\dot{\gamma}}
\newcommand{\etal}{et al.\,}
\newcommand{\invs}{~s$^{-1}$\xspace}
\usepackage[usenames,dvipsnames,svgnames,x11names,table]{xcolor}
%\usepackage[latin1]{inputenc}
\usepackage{tikz}
\usetikzlibrary{shapes,arrows}

%\usepackage{psfrag,pstricks}
%\addtolength{\oddsidemargin}{-.675in}
%\addtolength{\evensidemargin}{-.675in}
%\addtolength{\textwidth}{1.35in}

\addtolength{\topmargin}{-.675in}
\addtolength{\textheight}{1.35in}
\topmargin -1.5cm        % read Lamport p.163
\oddsidemargin -0.04cm   % read Lamport p.163
\evensidemargin -0.04cm  % same as oddsidemargin but for left-hand pages
\textwidth 16.59cm
\textheight 21.94cm 
%\pagestyle{empty}       % Uncomment if don't want page numbers
\parskip 7.2pt           % sets spacing between paragraphs
\renewcommand{\baselinestretch}{1.0} 	% Uncomment for 1.5 spacing between lines
\parindent 0pt		  % sets leading space for paragraphs
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage[font=small,labelfont=bf,margin=10pt]{caption}
\hypersetup{
  pdfborderstyle={/S/U/W 1},
  pdfborder={0 0 100},
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.1.1 (Org mode 8.1.2)}} %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
% To change the background color of verbatim sections in latex
\colorlet{LightSteelBlue10}{LightSteelBlue1!30}
\colorlet{SteelBlue40}{SteelBlue4!60!black}
\newcommand{\verbStyle}[1]{{\color{SteelBlue40}\colorbox{LightSteelBlue10}{{#1}}}}
\let\OldTexttt\texttt
\renewcommand{\texttt}[1]{\OldTexttt{\verbStyle{#1}}}
\date{\today}
\title{Instructions}
\hypersetup{
 pdfauthor={},
 pdftitle={Instructions},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.3.1 (Org mode 8.3.1)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{itemize}
\item The following five files will be output from the interface (under \texttt{inputs/} directory):
\begin{itemize}
\item \texttt{eweld.in}
\item \texttt{eweld\_weld\_parameters.in}
\item \texttt{eweld\_boundary\_condition.in}
\item \texttt{eweld\_preheat\_interpass\_temperature.in}
\item \texttt{eweld\_temperature\_monitor.in}
\item \texttt{eweld\_mesh\_key.txt} (Not need to do now. This option will allow users to input their own meshes. )
\end{itemize}

\item For automatic mesh, the following steps will be run:
\begin{enumerate}
\item Check if \texttt{pass\_coordinates.out} exists in \texttt{input} directory, if no, run \\
\texttt{utils/determine\_passes\_arc\_v4.exe} to create \texttt{inputs/pass\_coordinates.out}\footnote{On Linux, compile \texttt{determine\_passes\_arc\_v4.out}, to get \texttt{determine\_passes\_arc\_v4.out} via \texttt{gfortran determine\_passes\_arc\_v4.for -o determine\_passes\_arc\_v4.out}}:
\begin{verbatim}
./utils/determine_passes_arc_v4.out inputs/
\end{verbatim}
\texttt{eweld.in} will be input.
\item Run \texttt{utils/Automesh\_v14.py} from SALOME's Python Console to create \texttt{Mesh\_3D.unv}, or run 
without Salome GUI:
\begin{verbatim}
$SALOMEPATH/salome start -t -w 1 utils/Automesh_v14.py \
--write_separate_step_files
\end{verbatim}
\begin{enumerate}
\item The input files are:
\begin{itemize}
\item \texttt{./inputs/eweld.in}
\item \texttt{./inputs/eweld\_weld\_parameters.in}
\item \texttt{./setting/Setting\_arc\_efficiency\_dfault.in}
\item \texttt{./inputs/pass\_coordinates.out}
\end{itemize}

\item The output files will be:
\begin{itemize}
\item \texttt{Mesh\_3D.unv}
\item \texttt{model\_dflux.for}
\item \texttt{model\_step1.inp}
\item \texttt{model\_step2.inp}
\item \texttt{model\_step3.inp}
\item \texttt{model\_step4.inp}
\item \texttt{model\_step5.inp}
\item \texttt{model\_step6.inp}
\item \texttt{model\_step7.inp}
\end{itemize}
\textbf{Note:} The \texttt{model\_step.inp} file has been broken into several files \\
(\texttt{model\_stepX.inp}) to
resolve and issue with post-processing of cases where elements get added during the simulation.
\end{enumerate}

\item Run \texttt{./utils/runCGX.sh} to generate the \texttt{nodesElems.inp} and \texttt{model\_film.in} files (using cgx and unical):
\begin{verbatim}
./utils/runCGX.sh Mesh_3D.unv ./utils/write_film.fbd
\end{verbatim}
\item Run 
\begin{verbatim}
python2 utils/Analysis_file_create.py
\end{verbatim}
\begin{itemize}
\item The input files are:
\begin{itemize}
\item \texttt{./inputs/eweld.in}
\item \texttt{./inputs/eweld\_boundary\_condition.in}
\item \texttt{./inputs/eweld\_preheat\_interpass\_temperature.in}
\item \texttt{./nodesElems.inp}
\end{itemize}
\item The output files will be: 
\begin{itemize}
\item \texttt{model\_bc.in}
\item \texttt{model\_ini\_temperature.in}
\item \texttt{model\_material.in}
\end{itemize}
\end{itemize}
\item Move \texttt{model\_dflux.for} to the CalculiX directory (to \texttt{CalculiX-PW/src/}) and rename to \texttt{dflux.f}, and compile CalculiX
(see the notes in \texttt{CalculiX-PW/README.md} for compilation/installation of CalculiX).
Or decompress \texttt{tools/CalculiX-PW.tar} (works under Ubuntu 14.04, if all the required packages for CalculiX are installed):
\begin{verbatim}
tar -xf tools/CalculiX-PW.tar
\end{verbatim}
\textbf{The script \texttt{./utils/compileCcx.sh} performs the above automatically on Ubuntu 14.04 if all required packages for compiling CalculiX are installed:}
\begin{verbatim}
./utils/compileCcx.sh model_dflux.for tools/CalculiX-PW.tar ccx_2.12_MT
\end{verbatim}
\item Run \texttt{analysis.inp} with CalculiX: 
To get around an issue with post-processing of results in 
cases with element addition/removal during simulation, we have
divided the simulation into several steps. In each step, 
the number of elements remain constant. To run the whole
simulation, restart files written at the end of one step are
used as a start point for the next step.  

The bash script \texttt{./tests/runCCX\_manual.sh} runs the multiple simulation steps 
consecutively. When running \texttt{./utils/runCCX\_manual.sh}, the number of processors can be specified
(the default number of processors is 1):
\begin{verbatim}
./tests/runCCX_manual.sh  4
\end{verbatim}
The output exo, sta and cvg files with be compressed in \texttt{ccx-results.tar} after the simulations
are complete.
\item Post processing: 
To post process the simulation results using Paraview, the Metrics Extraction Python 
library can be used. The properties of image and metrics can be specified via a json file.
An example json file is in \url{file:///setting/mex/welding_anim.json}. 
For details of the json syntax please see \\
\url{https://github.com/parallelworks/MetricExtraction}. 

To generate images and animations and extract statistics, follow these steps:
\begin{enumerate}
\item Set the environment variable \texttt{PARAVIEWPATH} to the path of Paraview on your system, i.e, 
to the directory of \texttt{pvpython}. For example if \texttt{pvpython} is in directory \texttt{/opt/paraview530/bin}, run:
\begin{verbatim}
export PARAVIEWPATH=/opt/paraview530/bin
\end{verbatim}
\item Archive the \texttt{model\_stepX.inp} files: 
\begin{verbatim}
tar -cf model_step.tar  model_step?*.inp
\end{verbatim}
\item Run \texttt{utils/mexdex/extract.sh}: 
\begin{verbatim}
./utils/mexdex/extract.sh model_step.tar ccx-results.tar \
setting/mex/welding_anim.json results/ results/metrics.csv \
pass_coordinates.out
\end{verbatim}
The images, animations and \texttt{metrics.csv} file (with extracted statistics) will be written under the directory \texttt{results}
\end{enumerate}
\end{enumerate}
\end{itemize}
\end{document}
